rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "movies" SET "title" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "2001: A Space Odyssey"], ["director", "abc123"], ["updated_at", "2016-03-01 21:07:40.606081"], ["id", 7]]

  def same_director
    @movie = Movie.find params[:id]
    @director = @movie.director
    if @director.length == 0
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    end
    @movies = Movie.where :director => @director
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Stanley Kubrick"]]